#!/bin/bash

read -p "Введите основную строку: " main_string

read -p "Введите подстроку: " substring

if [[ "$main_string" == *"$substring"* ]]; then
    echo "--------------------------------------------------"
    echo "✅ Строка СОДЕРЖИТ подстроку."
    echo "Основная строка: '$main_string'"
    echo "Подстрока: '$substring'"
    echo "--------------------------------------------------"
else
    echo "--------------------------------------------------"
    echo "❌ Строка НЕ СОДЕРЖИТ подстроку."
    echo "Основная строка: '$main_string'"
    echo "Подстрока: '$substring'"
    echo "--------------------------------------------------"
fi


